Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: For more information, see the xref:security-cors.adoc#cors-filter[CORS filter] section of the "Cross-origin resource sharing" guide.
ja_jp: 詳細は、「クロスオリジンリソース共有」ガイドの xref:security-cors.adoc#cors-filter[CORS フィルター] セクションを参照してください。

source: For more information, see the xref:security-keycloak-admin-client.adoc[Quarkus Keycloak Admin Client] guide.
ja_jp: 詳細は、xref:security-keycloak-admin-client.adoc[Quarkus Keycloak Admin Client] ガイドを参照してください。

source: For more information, see the xref:security-oidc-code-flow-authentication.adoc#access_id_and_access_tokens[Access ID and Access Tokens] section of the reference guide.
ja_jp: 詳細については、リファレンス・ガイドの xref:security-oidc-code-flow-authentication.adoc#access_id_and_access_tokens[アクセスIDとアクセストークン] のセクションを参照してください。

source: For more information, see the xref:security-openid-connect-client.adoc[OpenID Connect client and token propagation quickstart] and xref:security-openid-connect-client-reference.adoc[OpenID Connect (OIDC) and OAuth2 client and filters reference] guides.
ja_jp: 詳しくは、xref:security-openid-connect-client.adoc[OpenID Connect クライアントとトークン伝搬クイックスタート]、xref:security-openid-connect-client-reference.adoc[OpenID Connect (OIDC) と OAuth2 クライアントとフィルターのリファレンス] ガイドをご覧ください。

source: For more information, see the xref:security-openid-connect-web-authentication/.adoc#proof-of-key-for-code-exchange-pkce[PKCE-related section] of the Quarkus "OpenID Connect (OIDC) Authorization Code Flow Mechanism" guide.
ja_jp: 詳細は、Quarkus の「OpenID Connect (OIDC) 認可コードフローメカニズム」ガイドの xref:security-openid-connect-web-authentication/.adoc#proof-of-key-for-code-exchange-pkce[PKCE 関連のセクション] を参照してください。

source: For more information, see the xref:validation.adoc#configuring-the-validatorfactory[Configuring the ValidatorFactory] section of the Quarkus "Validation with Hibernate Validator" guide.
ja_jp: 詳細は、Quarkus の「Hibernate Validator を使用した検証」ガイドの xref:validation.adoc#configuring-the-validatorfactory[ValidatorFactory の設定] セクションを参照してください。

source: For more information, see xref:cache.adoc#generating-a-cache-key-with-cachekeygenerator[Generating a cache key with CacheKeyGenerator].
ja_jp: 詳細は、xref:cache.adoc#generating-a-cache-key-with-cachekeygenerator[CacheKeyGenerator を使用したキャッシュキーの生成] を参照してください。

source: For more information, see xref:deploying-to-kubernetes.adoc#client-connection-configuration[deploying to Kubernetes].
ja_jp: 詳細については、 xref:deploying-to-kubernetes.adoc#client-connection-configuration[Kubernetesへのデプロイ] を参照。

source: For more information, see xref:loggingConfigurationReference[Logging configuration reference].
ja_jp: 詳細については、 xref:loggingConfigurationReference[ログ設定リファレンス] を参照してください。

source: For more information, see xref:security-jwt.adoc[Using SmallRye JWT role-based access control].
ja_jp: 詳細については、xref:security-jwt.adoc[SmallRye JWTロールベースアクセスコントロールの使用] を参照してください。

source: For more information, see xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-security-annotation[Use TestingSecurity with injected JsonWebToken].
ja_jp: 詳細は、xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-security-annotation[注入された JsonWebToken での TestingSecurityの使用] を参照してください。

source: For more information, see xref:security-oidc-code-flow-authentication.adoc[OIDC code flow mechanism for protecting web applications].
ja_jp: 詳細については、 xref:security-oidc-code-flow-authentication.adoc[ウェブアプリケーションを保護するためのOIDCコードフロー] メカニズムを参照してください。

source: For more information, see xref:security-openid-connect-web-authentication.adoc#proof-of-key-for-code-exchange-pkce[OpenID Connect (OIDC) Authorization Code Flow Mechanism].
ja_jp: 詳細は、xref:security-openid-connect-web-authentication.adoc#proof-of-key-for-code-exchange-pkce[OpenID Connect (OIDC) 認可コードフローメカニズム] を参照してください。

source: For more information, see xref:security-testing.adoc#configuring-user-information[Configuring User Information] in the "Security Testing" guide.
ja_jp: また、「セキュリティテスト」ガイドの xref:security-testing.adoc#configuring-user-information[ユーザー情報の設定] も参照してください。

source: For more options, such as Homebrew or Chocolatey, see <a href="/guides/cli-tooling">the Quarkus CLI guide</a>.
ja_jp: Homebrew や Chocolatey などのその他のオプションについては、<a href="/guides/cli-tooling">Quarkus CLI ガイド</a>を参照してください。

source: For more technical details, visit the AWS Lambda SnapStart blog http://aws.amazon.com/blogs/aws/new-accelerate-your-lambda-functions-with-lambda-snapstart[here].
ja_jp: 技術的な詳細については、AWS Lambda SnapStart ブログ http://aws.amazon.com/blogs/aws/new-accelerate-your-lambda-functions-with-lambda-snapstart[こちら] にアクセスしてください。

source: For most extensions this will just work 'out of the box', however it is still a good idea to have a smoke test to verify that this functionality is working as expected. To test this we use `QuarkusDevModeTest`:
ja_jp: ほとんどのエクステンションでは、これは「箱から出してすぐに」動作しますが、この機能が期待通りに動作しているかどうかを確認するためにスモークテストを行うことをお勧めします。このテストには `QuarkusDevModeTest` を使用します。

source: For most extensions, this is the minimum expectation. When wrapping an existing library, this is usually trivial to achieve; if an extension is providing net-new capability, it might be a bit more work. Quarkus provides tools for xref:writing-extensions.adoc#testing-extensions[unit testing and integration testing] extensions.
ja_jp: ほとんどのエクステンションの場合、これが最低限の期待値です。 既存のライブラリーをラップする場合、これは通常簡単に実現できますが、エクステンションがまったく新しい機能を提供する場合は、もう少し作業が必要になる可能性があります。Quarkus は、xref:writing-extensions.adoc#testing-extensions[ユニットテストと結合テスト] エクステンション用のツールを提供します。

source: For most of our use cases, we can process annotations at build time and generate the necessary bytecode so there's no need to inspect them at runtime. Jandex, our annotation indexer, is a fantastic tool for this, and we use it extensively in Quarkus. But... there are still cases where annotations are read at runtime, even in Quarkus.
ja_jp: ほとんどのユースケースでは、ビルド時にアノテーションを処理し、必要なバイトコードを生成できるため、実行時に検査する必要はありません。私たちのアノテーションインデクサーである Jandex は、このための素晴らしいツールであり、Quarkus で広く使用されています。しかし... Quarkus でさえ、実行時にアノテーションが読み込まれるケースがまだ存在します。

source: For multi-module projects, more config properties might be needed. Typically, when an extension project contains multiple extensions that depend on each other, a more complex configuration is required. In the following project we have two extensions submodules: `foo` and `bar`.
ja_jp: マルチモジュールプロジェクトの場合、さらに多くの設定プロパティーが必要になる場合があります。通常、エクステンションプロジェクトに互いに依存する複数のエクステンションが含まれている場合、より複雑な設定が必要になります。以下のプロジェクトでは、`foo` と `bar` という 2 つのエクステンションサブモジュールがあります。

source: For named `mongo` clients, the name of the client is used.
ja_jp: 名前付き `mongo` クライアントの場合、クライアントの名前が使われます。

source: For named datasources, the name of the datasource is used.
ja_jp: 名前付きデータソースの場合、データソースの名前が使用されます。

source: For native executable builds, it is recommended to either use the available JDBC Quarkus extensions or contribute a custom extension for your specific driver.
ja_jp: ネイティブ実行可能ファイルをビルドする場合は、利用可能なJDBC Quarkusエクステンションを使用するか、特定のドライバー用にカスタムエクステンションを作成することをお勧めします。

source: For native image, however the URL Connection client must be preferred over the Apache HTTP Client when using synchronous mode, due to issues in the GraalVM compilation (at present).
ja_jp: しかしながら、ネイティブイメージに対しては、同期モードを使用する場合は、GraalVMのコンパイルの問題のため、Apache HTTPクライアントよりもURL接続クライアントを優先する必要があります(現在のところ)。

source: For native image, however, the URL Connection client must be preferred over the Apache HTTP Client when using synchronous mode, due to issues in the GraalVM compilation (at present).
ja_jp: ただし、ネイティブイメージの場合、（現時点では）GraalVMのコンパイルに問題があるため、同期モードを使用する場合は、Apache HTTP ClientよりもURL Connectionクライアントを優先する必要があります。

source: For newly generated applications, this new `quarkus` packaging will be the default.
ja_jp: 新しく生成されるアプリケーションでは、この新しい `quarkus` パッケージングがデフォルトになります。

source: For non default connections, combine the qualifier `@InfinispanClientName` and `@Remote`.
ja_jp: デフォルト以外の接続の場合は、 `@InfinispanClientName` 修飾子と `@Remote` 修飾子を組み合わせてください。

source: For non-CDI components, use the `io.smallrye.config.SmallRyeConfig#getConfigMapping` API to retrieve the config mapping instance:
ja_jp: 非 CDI コンポーネントの場合は、 `io.smallrye.config.SmallRyeConfig#getConfigMapping` API を使用して設定マッピングインスタンスを取得します。

source: For now `@TestHTTPResource` allows you to inject `URI`, `URL` and `String` representations of the URL.
ja_jp: 今のところ `@TestHTTPResource` では、URL の `URI` , `URL` , `String` 表現を注入することができます。

source: For now the application does nothing new.
ja_jp: ここまでは、このアプリケーションは特に新しい動作をしていません。

source: For now the easiest way to get started is using https://code.quarkus.io/?S=io.quarkus.platform%3A3.0[code.quarkus.io] or use the Quarkus CLI:
ja_jp: 今のところ、最も簡単な方法は、 https://code.quarkus.io/?S=io.quarkus.platform%3A3.0[code.quarkus.io] を使用するか、Quarkus CLIを使用することです：

source: For now this only works for single file jbang scripts, future releases will enable it to work for multiple files too.
ja_jp: 今のところ、これは単一ファイルのjbangスクリプトに対してのみ動作しますが、将来のリリースでは複数のファイルに対しても動作するようになるでしょう。

source: For now, Quarkus only records REST events, but we plan to use this ID to link each event to each other as we add more events in the future.
ja_jp: 現時点では、Quarkus は REST イベントのみを記録しますが、将来的にイベントを追加する際には、この ID を使用して各イベントを相互にリンクする予定です。

source: For now, multiple datasources are only supported for JDBC and the Agroal extension. So it is not currently possible to create multiple reactive datasources.
ja_jp: 現在のところ、複数のデータソースは JDBC と Agroal 拡張でのみサポートされています。そのため、現在、複数の反応性データソースを作成することはできません。

source: For now, the documentation for our `main` branch is not available on the website yet. It will be available soon.
ja_jp: 今のところ、 `main` ブランチのドキュメントは、まだウェブサイトでは公開されていません。近いうちに公開される予定です。

source: For optimal results, the AOT cache should be "trained" by running actual application workloads. Quarkus can use your `@QuarkusIntegrationTest` test suite for this training:
ja_jp: 最適な結果を得るには、実際のアプリケーションワークロードを実行して AOT キャッシュを「トレーニング」する必要があります。 Quarkus は、このトレーニングに `@QuarkusIntegrationTest` テストスイートを使用できます。

source: For optimum findability, add a short description using user-oriented keywords to summarize the document's purpose, task, and intent in no more than three sentences. Avoid self-referential expressions and filler words, such as "This document..", "This tutorial..", and "The following.." Mentioning the benefits users gain from reading the content is also helpful.
ja_jp: 検索しやすさを最適化するには、ユーザー指向のキーワードを使用して短い説明を追加し、ドキュメントの目的、タスク、および意図を 3 センテンス以内で要約します。「このドキュメント..」、「このチュートリアル..」、「次の..」などの自己言及的な表現やつなぎ言葉は避けてください。 ユーザーがコンテンツを読むことで得られるメリットについて言及することも役に立ちます。

source: For other extensions, the codestart will typically be located in the runtime module (with special instruction in the `pom.xml` to generate a separate codestart artifact).
ja_jp: その他のエクステンションの場合、Codestartは通常、ランタイム・モジュールに配置されます（別の Codestart アーティファクトを生成するよう、 `pom.xml` に特別な指示があります）。

source: For other templates an explicit parameter declaration is needed:
ja_jp: その他のテンプレートでは、明示的なパラメーター宣言が必要です。

source: For our existing functionality, we wanted to cover more existing use cases, and instances where a problem can be easily flagged and a solution suggested.
ja_jp: 既存の機能については、より既存のユースケースをカバーし、問題点を簡単に指摘し、解決策を提案できるようにしたいと思いました。

source: For our quickstart, one Kubernetes service will contain all functions. There's no reason you couldn't break up this quickstart into multiple different projects and deploy a service for each function. For simplicity, and to show that you don't have to have a deployment per function, the quickstart combines everything into one project, image, and service.
ja_jp: 今回のクイックスタートでは、1つのKubernetesサービスにすべての関数を格納します。このクイックスタートを複数の異なるプロジェクトに分割し、各関数にサービスをデプロイできない理由はありません。簡単にするために、また関数ごとにデプロイメントを行う必要がないことを示すために、クイックスタートはすべてを1つのプロジェクト、イメージ、サービスにまとめます。

source: For paged responses, `spring-data-rest` also returns a set of link headers that can be used to access other pages: first, previous, next and last.
ja_jp: ページングされたレスポンスの場合、 `spring-data-rest` は、他のページにアクセスするために使用できるリンクヘッダーのセット（first、previous、next、last）も返します。

source: For performance reasons, the context (e.g., CDI or security context) is not propagated into each health check invocation. However, if you need to enable this functionality you can set the config property `quarkus.smallrye-health.context-propagation=true` to allow the context propagation into every health check call.
ja_jp: パフォーマンス上の理由から、コンテキスト（例：CDIまたはセキュリティ・コンテキスト）は各ヘルスチェック呼び出しに伝搬されません。しかし、この機能を有効にする必要がある場合は、 `quarkus.smallrye-health.context-propagation=true` を設定して、すべてのヘルスチェック呼び出しにコンテキストの伝搬を許可することができます。

source: For podman:
ja_jp: podman の場合:

source: For production we would recommend to use something like the xref:flyway.adoc[Flyway database migration tool]. But for development we can simply drop and create the tables on startup, and then insert a few fruits.
ja_jp: 本番環境では、xref:flyway.adoc[Flyway database migration tool] のようなものを使用することをお勧めします。しかし、開発のためには、単に起動時にテーブルをドロップして作成し、いくつかの fruits を挿入することができます。

source: For production, we would recommend to use something like the xref:flyway.adoc[Flyway database migration tool]. But for development we can simply drop and create the tables on startup, and then insert a few fruits.
ja_jp: 本番環境では xref:flyway.adoc[Flyway データベースマイグレーションツール] のようなものを使用することをお勧めします。しかし、開発時には単純に起動時にテーブルをドロップして作成し、いくつかの fruits を挿入することができます。

source: For production-ready Kafka brokers, please see the https://strimzi.io/[Strimzi documentation^] for how to properly deploy and configure production-ready Kafka brokers on Kubernetes. You can also try out a https://developers.redhat.com/products/red-hat-openshift-streams-for-apache-kafka/getting-started[fully hosted and managed Kafka service^]!
ja_jp: 本番対応のKafkaブローカーについては、Kubernetes上で本番対応のKafkaブローカーを適切に展開・設定する方法について、 link:https://strimzi.io/[Strimziのドキュメント, window=_blank]をご覧ください。また、 link:https://developers.redhat.com/products/red-hat-openshift-streams-for-apache-kafka/getting-started[完全にホストされ、管理されたKafkaサービス, window=_blank]を試すこともできます!

source: For production-ready Prometheus instances, please see the https://operatorhub.io/operator/prometheus[Prometheus Operator documentation^] for how to properly deploy and configure production-ready instances.
ja_jp: 本番環境用のPrometheusインスタンスについては、 link:https://operatorhub.io/operator/prometheus[Prometheus Operatorのドキュメント, window=_blank]で、本番環境用のインスタンスの適切な導入・設定方法をご確認ください。

source: For projects that use Hibernate ORM or Hibernate Reactive, review the link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[Hibernate ORM 5 to 6 migration] quick reference. The following update command covers only a subset of this guide.
ja_jp: Hibernate ORM または Hibernate Reactive を使用するプロジェクトについては、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[Hibernate ORM 5 から 6 への移行] クイックリファレンスを参照してください。 以下の更新コマンドは、このガイドのサブセットのみをカバーしています。

source: For questions related to the development of Quarkus:
ja_jp: Quarkusの開発に関する質問は、以下をご利用下さい：

source: For quick creation of a hashed password, use `String BcryptUtil.bcryptHash(String password)`, which defaults to creating a random salt and hashing in ten iterations. This method also allows specifying the desired amount of iterations and the salt used.
ja_jp: ハッシュ化されたパスワードを素早く作成するには、 `String BcryptUtil.bcryptHash(String password)` を使用します。デフォルトでは、ランダムなソルトが作成され、10回の反復でハッシュ化されます。このメソッドでは、希望する反復回数と使用するソルトを指定することも可能です。

source: For reactive operations, it is fairly similar:
ja_jp: リアクティブ操作の場合も同様です。

source: For reactive workloads, please always use xref:rest.adoc[Quarkus REST].
ja_jp: リアクティブワークロードの場合は、常に xref:rest.adoc[Quarkus REST] を使用してください。

source: For reactive workloads, please always use xref:resteasy-reactive.adoc[RESTEasy Reactive].
ja_jp: リアクティブなワークロードには、常に xref:resteasy-reactive.adoc[RESTEasy Reactive] を使用してください。

source: For reactive, we use the https://vertx.io/[Vert.x] reactive drivers.
ja_jp: リアクティブには、 https://vertx.io/[Vert.x] リアクティブドライバーを使用します。

source: For readability we use classes with public fields, but classes with private fields with public getters and setters will also work.
ja_jp: 可読性の為にpublicなフィールドを持つクラスを使用していますが、publicなゲッターとセッターを持つprivateなフィールドを持つクラスも使用できます。

source: For reference guides of specific Reactive Messaging extensions see xref:kafka.adoc[Apache Kafka Reference Guide], xref:amqp-reference.adoc[Reactive Messaging AMQP 1.0 Connector], xref:rabbitmq-reference.adoc[Reactive Messaging RabbitMQ Connector] or xref:pulsar.adoc[Apache Pulsar Reference Guide].
ja_jp: 特定の Reactive Messaging エクステンションのリファレンスガイドについては、xref:kafka.adoc[Apache Kafka リファレンスガイド]、xref:amqp-reference.adoc[Reactive Messaging AMQP 1.0 コネクター]、xref:rabbitmq-reference.adoc[Reactive Messaging RabbitMQ コネクター]、または xref:pulsar.adoc[Apache Pulsar リファレンスガイド] を参照してください。

source: For running the blocking processing on Java _virtual threads_, see the xref:messaging-virtual-threads.adoc[Quarkus Virtual Thread support with Reactive Messaging documentation].
ja_jp: Java _仮想スレッドでの_ ブロッキング処理の実行については、 xref:messaging-virtual-threads.adoc[Quarkus Virtual Thread support with Reactive Messagingのドキュメント] を参照してください。

source: For scenarios where neither Dev Services nor a custom database setup is possible, you can use a JVM based database such as H2 in embedded mode.
ja_jp: Dev Services もカスタムデータベースセットアップも不可能なシナリオでは、組み込みモードの H2 などの JVM ベースのデータベースを使用できます。

source: For schema-less Json serialization, if the `schema` configuration is set to `ObjectMapper<fully_qualified_name_of_the_bean>`, a Schema will be generated using the Jackson `ObjectMapper`, without enforcing a Pulsar Schema validation. `io.quarkus.pulsar.schema.ObjectMapperSchema` can be used to explicitly configure JSON schema without validation.
ja_jp: スキーマレス JSON シリアライゼーションでは、 `schema` 設定が `ObjectMapper<fully_qualified_name_of_the_bean>` に設定されている場合、Jackson `ObjectMapper` を使用してスキーマが生成されます。このとき、Pulsar Schema 検証は適用されません。 `io.quarkus.pulsar.schema.ObjectMapperSchema` を使用すると、検証なしで JSON スキーマを明示的に設定できます。

source: For security reasons, Quarkus restricts JNDI usage within applications to help mitigate potential vulnerabilities like Log4Shell. To support `mongo+srv://`, Quarkus provides an alternative DNS client.
ja_jp: セキュリティ上の理由から、Quarkusでは、Log4Shellのような潜在的な脆弱性を軽減するために、アプリケーション内でのJNDIの使用を制限しています。 `mongo+srv://` をサポートするために、Quarkusは代替のDNSクライアントを提供しています。

source: For servlet: `{url}/servlet/hello`
ja_jp: サーブレットの場合: `{url}/servlet/hello`

source: For servlet: {httpsTrigger.url}/servlet/hello
ja_jp: サーブレットの場合: {httpsTrigger.url}/servlet/hello

source: For significant changes or updates to generated configuration documentation, build the `docs` module locally and run the Vale linter as outlined in the following sections.
ja_jp: 生成された設定ドキュメントの大幅な変更や更新は、 `docs` モジュールをローカルでビルドし、以下のセクションで説明するように Vale linter を実行してください。

source: For simple web applications, the Web Bundler is the easiest and fastest way to get started
ja_jp: シンプルなウェブアプリケーション。Web バンドラーは最も簡単で最速の方法です。

source: For simplicity in this tutorial, we will avoid GraalVM and Mandrel prerequisites.
ja_jp: このチュートリアルでは、簡単のために、graalvm/mandrel の前提条件を避けることにします。

source: For simplicity in this tutorial, we will avoid graalvm/mandrel prerequisites
ja_jp: このチュートリアルでは、簡素化するために、graalvm/mandrel の前提条件を避けることにします。

source: For simplicity's sake, this code handles only one `TimeTable` instance, but it is straightforward to enable multi-tenancy and handle multiple `TimeTable` instances of different high schools in parallel.
ja_jp: わかりやすくするために、このコードは 1 つの `TimeTable` インスタンスのみを処理しますが、簡単にマルチテナンシーを有効にして、異なる高校の複数の `TimeTable` インスタンスを並行処理できます。

source: For simplicity's sake, this initial implementation waits for the solver to finish, which can still cause an HTTP timeout. The _complete_ implementation avoids HTTP timeouts much more elegantly.
ja_jp: 分かりやすくするために、この最初の実装はソルバーが終了するのを待ちますが、それでも HTTP タイムアウトが発生する可能性があります。_完全な_実装では、HTTP タイムアウトはさらにスムーズに回避されます。

source: For simplicity, we're only calling the query named `allFilms`. We named our corresponding method `allFilms` too. If we named the method differently, we would need to annotate it with `@Query(value="allFilms")` to specify the name of the query that should be executed when this method is called.
ja_jp: わかりやすくするために、 `allFilms` という名前のクエリだけを呼び出しています。対応するメソッドの名前も `allFilms` としました。もしメソッドの名前が違っていたら、このメソッドが呼ばれたときに実行されるべきクエリの名前を指定するために、 `@Query(value="allFilms")` をアノテーションする必要があります。

source: For some inspiration in this area, have a look at xref:logging.adoc#simplified-logging[simplified logging], xref:hibernate-orm-panache.adoc[simplified Hibernate ORM with Panache], the xref:rest-client.adoc#query-parameters[`@RestQuery` annotation], or the way Quarkus allows test containers to be used xref:getting-started-dev-services.adoc[without any configuration].
ja_jp: この分野でのアイデアの参考として、xref:logging.adoc#simplified-logging[シンプル化されたロギング]、xref:hibernate-orm-panache.adoc[Panache を使用したシンプルな Hibernate ORM]、xref:rest-client.adoc#query-parameters[@RestQuery アノテーション]、または Quarkus がテストコンテナを xref:getting-started-dev-services.adoc[設定なしで使用できるようにする方法] を参照してください。

source: For some, it will make sense to use humanly readable (unstructured) logging in dev mode and JSON logging (structured) in production mode. This can be achieved using different profiles, as shown in the following configuration.
ja_jp: 開発モードでは人間が読める（構造化されていない）ロギングを使い、運用モードでは JSON ロギング（構造化されている）を使うことが理にかなっている場合もあるでしょう。 これは、次の設定に示すように、異なるプロファイルを使うことで実現できます。

source: For some, it will make sense to use logging that is humanly readable (unstructured) in dev mode and JSON logging (structured) in production mode. This can be achieved using different profiles, as shown in the following configuration.
ja_jp: いくつかの場合、devモードでは人間が読める(構造化されていない)ロギングを使用し、本番モードではJSONロギング(構造化されている)を使用することが理にかなっているでしょう。これは、以下の設定で示されているように、異なるプロファイルを使用して達成することができます。

source: For suggestions regarding integration testing, see <<in-memory-databases,Testing with in-memory databases>> .
ja_jp: 統合テストに関する提案については、<<in-memory-databases,インメモリーデータベースを使用したテスト>> を参照してください。

source: For templating and server-side rendering with Quarkus, there are different engines available such as xref:qute.adoc[Qute] or https://docs.quarkiverse.io/quarkus-freemarker/dev/[Freemarker] and others.
ja_jp: Quarkus を使用したテンプレート作成と server-side rendering には、xref:qute.adoc[Qute] や https://docs.quarkiverse.io/quarkus-freemarker/dev/[Freemarker] などのさまざまなエンジンが利用できます。

source: For testing web applications, https://docs.quarkiverse.io/quarkus-playwright/dev/[Quarkus Playwright] is very easy to use. You can create effective cross-browser end-to-end tests mimicking user interaction and making sure your web application is working as a whole. The big advantage is that it benefits from all dev-services and Quarkus mocking features.
ja_jp: Web アプリケーションのテストには、 https://docs.quarkiverse.io/quarkus-playwright/dev/[Quarkus Playwright] が非常に便利です。ユーザー操作を模倣し、Web アプリケーション全体が動作していることを確認できる、効果的なクロスブラウザーエンドツーエンドテストを作成できます。大きな利点は、すべての開発サービスと Quarkus のモック機能を利用できることです。

source: For testing, Quarkus starts up a separate Mock Event server under port 8081. The default port for Rest Assured is automatically set to 8081 by Quarkus, so you don't have to worry about setting this up.
ja_jp: テストのために、Quarkus はポート 8081 で別の Mock Event サーバーを起動します。Rest Assured のデフォルトポートは Quarkus によって自動的に 8081 に設定されるため、これを設定する必要はありません。

source: For that reason, when enabling <<database-approach,database multi-tenancy>>, it is recommended to explicitly point the Hibernate ORM configuration to one datasource among those that will be used at runtime, e.g. with `quarkus.hibernate-orm.datasource=base` (`base` being the name of a datasource).
ja_jp: このような理由から、<<database-approach,database multi-tenancy>> を有効化する場合は、 実行時に使用されるデータソースの中から 1 つを Hibernate ORM の設定で明示的に 指定することを推奨します。たとえば、 `quarkus.hibernate-orm.datasource=base` (`base` はデータソースの名前) などのように指定します。
